Catalogs/РабочиеЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>РабочиеЦентры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяЗагрузка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентВремениРаботы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РабочиеЦентры/Forms/СтруктураРабочихЦентров/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
&Вместо("НастроитьЗависимыеЭлементыФормы")
Процедура Рин1_НастроитьЗависимыеЭлементыФормы(Форма, СписокРеквизитов)

	Элементы = Форма.Элементы;
	
	Инициализация = ПустаяСтрока(СписокРеквизитов);
	СтруктураРеквизитов = Новый Структура(СписокРеквизитов);
	
	// Настройка по режиму работы - виды РЦ/участки
	Если СтруктураРеквизитов.Свойство("РежимРаботыПоУчасткам")
		ИЛИ Инициализация Тогда
		
		Элементы.РабочиеЦентрыОтборПоВиду.Видимость = НЕ Форма.РежимРаботыПоУчасткам;
		Элементы.РабочиеЦентрыОтборПоУчастку.Видимость = Форма.РежимРаботыПоУчасткам;
		
		Элементы.СтраницыВедущийСписок.ТекущаяСтраница = ?(Форма.РежимРаботыПоУчасткам,
			Элементы.СтраницаУчастки,
			Элементы.СтраницаВидыРабочихЦентров);
		
		МассивСтрок = Новый Массив;
		
		//bercut281119
		МассивСтрок2 = Новый Массив;
		//
		
		Если Форма.ЕстьУчастки Тогда
			
			Если Форма.РежимРаботыПоУчасткам Тогда
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Участки';
																		|en = 'Areas'")));				
			Иначе
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Участки';
																		|en = 'Areas'"),,,,"#Участки"));
			КонецЕсли;
			
			МассивСтрок.Добавить("  ");
			
		КонецЕсли;
		
		Если Форма.РежимРаботыПоУчасткам Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Виды рабочих центров';
			|en = 'Work center kinds'"),,,,"#ВидыРЦ"));
			
			//bercut281119
				Если Форма.РежимРаботыПоРабочимЦентрам Тогда
					МассивСтрок2.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Виды рабочих центров';
					|en = 'Work center kinds'"),,,,"#ВидыРЦ"));
					
					МассивСтрок2.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '  Рабочие центры';
					|en = 'Work center'")));
					
					Элементы.РабочиеЦентры.Видимость = Истина;
					Элементы.ВРЦ.Видимость = Ложь;
				Иначе
					МассивСтрок2.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Виды рабочих центров';
					|en = 'Work center kinds'")));
					
					МассивСтрок2.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '  Рабочие центры';
					|en = 'Work center kinds'"),,,,"#РЦ"));
					
					Элементы.РабочиеЦентры.Видимость = Ложь;
					Элементы.ВРЦ.Видимость = Истина;
					
				КонецЕсли;
			//
			
		Иначе
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Виды рабочих центров';
			|en = 'Work center kinds'")));
			
			//bercut281119
			МассивСтрок2.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Рабочие центры';
			|en = 'Work center'")));
			
			Элементы.РабочиеЦентры.Видимость = Истина;
			Элементы.ВРЦ.Видимость = Ложь;
			//
			
		КонецЕсли;
		
		Форма.ЗаголовокВедущийСписок = Новый ФорматированнаяСтрока(МассивСтрок);
		
		//bercut281119
		Форма.ЗаголовокВидыРабочихЦентров = Новый ФорматированнаяСтрока(МассивСтрок2);
		//
		
	КонецЕсли;
	
	// Отбор по виду РЦ
	Если СтруктураРеквизитов.Свойство("ВидыРабочихЦентров")
		ИЛИ СтруктураРеквизитов.Свойство("РежимРаботыПоУчасткам") Тогда
		
		ЗначениеОтбора = ?(Элементы.ВидыРабочихЦентров.ТекущаяСтрока <> Неопределено,
			Элементы.ВидыРабочихЦентров.ТекущаяСтрока,
			ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.ПустаяСсылка"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.РабочиеЦентры, 
			"ВидРабочегоЦентра",
			ЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.ВИерархии,
			, 
			Форма.ОтборПоВидуУчастку И НЕ Форма.РежимРаботыПоУчасткам);
		
	КонецЕсли;
	
	// Отбор по участку
	Если СтруктураРеквизитов.Свойство("Участки")
		ИЛИ СтруктураРеквизитов.Свойство("РежимРаботыПоУчасткам") Тогда
		
		УстановитьОтбор = Ложь;
		ЗначениеОтбора = Неопределено;
		
		Если ТипЗнч(Элементы.Участки.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			
			УстановитьОтбор = Истина;
			
			ЗначениеОтбора = ?(Элементы.Участки.ТекущаяСтрока <> Неопределено,
				Элементы.Участки.ТекущаяСтрока,
				ПредопределенноеЗначение("Справочник.ПроизводственныеУчастки.ПустаяСсылка"));
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.РабочиеЦентры, 
			"Участок",
			ЗначениеОтбора, 
			ВидСравненияКомпоновкиДанных.Равно,
			,
			УстановитьОтбор И Форма.ОтборПоВидуУчастку И Форма.РежимРаботыПоУчасткам);
			
			//bercut281119	
			Если Элементы.ВРЦ.Видимость Тогда
				
				УстановитьОтбор = Ложь;
				ЗначениеОтбора = Неопределено;
				
				Если ТипЗнч(Элементы.Участки.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
					
					УстановитьОтбор = Истина;
					
					ЗначениеОтбора = ?(Элементы.Участки.ТекущаяСтрока <> Неопределено,
					Элементы.Участки.ТекущаяСтрока,
					ПредопределенноеЗначение("Справочник.ПроизводственныеУчастки.ПустаяСсылка"));
					
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Форма.ВРЦ, 
				"Участок",
				ЗначениеОтбора, 
				ВидСравненияКомпоновкиДанных.Равно,
				,
				УстановитьОтбор И Форма.ОтборПоВидуУчастку И Форма.РежимРаботыПоУчасткам);	
				
			КонецЕсли;	
			//
			
		КонецЕсли;
		
		// Отбор рабочих центров по подразделению (в тч отбор по группировочной строке)
		Если СтруктураРеквизитов.Свойство("Подразделение")
		ИЛИ СтруктураРеквизитов.Свойство("Участки")
		ИЛИ СтруктураРеквизитов.Свойство("РежимРаботыПоУчасткам") Тогда
		
		УстановитьОтбор = Ложь;
		ЗначениеОтбора = Неопределено;
		
		Если ЗначениеЗаполнено(Форма.Подразделение) Тогда
			
			УстановитьОтбор = Истина;
			ЗначениеОтбора = Форма.Подразделение;
			
		ИначеЕсли Форма.ОтборПоВидуУчастку
			И Форма.РежимРаботыПоУчасткам
			И ТипЗнч(Элементы.Участки.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			
			УстановитьОтбор = Истина;
			ЗначениеОтбора = Элементы.Участки.ТекущаяСтрока.Ключ;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.РабочиеЦентры, 
			"ВидРабочегоЦентра.Подразделение", 
			ЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			УстановитьОтбор);
		
	КонецЕсли;
	
	// Отбор рабочих центров по подразделению (инициализация)
	Если Инициализация Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.РабочиеЦентры, 
			"ВидРабочегоЦентра.Подразделение", 
			Форма.Подразделение, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			ЗначениеЗаполнено(Форма.Подразделение));
			
	КонецЕсли;
	
	// Отбор по подразделению
	Если СтруктураРеквизитов.Свойство("Подразделение")
		ИЛИ Инициализация Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.ВидыРабочихЦентров, 
			"Подразделение", 
			Форма.Подразделение, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			ЗначениеЗаполнено(Форма.Подразделение));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.Участки, 
			"Владелец", 
			Форма.Подразделение, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			ЗначениеЗаполнено(Форма.Подразделение));
		
	КонецЕсли;
	
	// Отображение списка РЦ
	Если СтруктураРеквизитов.Свойство("ОтборПоВидуУчастку")
		ИЛИ СтруктураРеквизитов.Свойство("Подразделение")
		ИЛИ СтруктураРеквизитов.Свойство("РабочиеЦентры_ПользовательскиеНастройки")
		ИЛИ Инициализация Тогда
		
		Если Форма.ОтборПоВидуУчастку ИЛИ НЕ Форма.Подразделение.Пустая() Тогда
			
			// Включили отбор
			Если Форма.ОтображениеСпискаРабочихЦентров = Неопределено
				ИЛИ СтруктураРеквизитов.Свойство("РабочиеЦентры_ПользовательскиеНастройки") Тогда
				
				Форма.ОтображениеСпискаРабочихЦентров = Элементы.РабочиеЦентры.Отображение;
				
			КонецЕсли;
			
			Если Элементы.РабочиеЦентры.Отображение <> ОтображениеТаблицы.Список Тогда
				
				Элементы.РабочиеЦентры.Отображение = ОтображениеТаблицы.Список;
				
			КонецЕсли;
			
		ИначеЕсли Форма.ОтображениеСпискаРабочихЦентров <> Неопределено Тогда
			
			// Отключили отбор
			Элементы.РабочиеЦентры.Отображение = Форма.ОтображениеСпискаРабочихЦентров;
			ОтображениеСпискаРабочихЦентров = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Пометка кнопок ОтборПоВидуУчастку
	Если СтруктураРеквизитов.Свойство("ОтборПоВидуУчастку") 
		ИЛИ Инициализация Тогда
		
		Элементы.РабочиеЦентрыОтборПоВиду.Пометка = Форма.ОтборПоВидуУчастку;
		Элементы.РабочиеЦентрыОтборПоУчастку.Пометка = Форма.ОтборПоВидуУчастку;
		
		//bercut281119
		Элементы.ВРЦОтборПоУчастку.Пометка = Форма.ОтборПоВидуУчастку;
		Элементы.ВРЦОтборПоУчастку.Пометка = Форма.ОтборПоВидуУчастку;
		//
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Рин1_ЗаголовокВидыРабочихЦентровОбработкаНавигационнойСсылкиВместо(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РежимРаботыПоРабочимЦентрам = НЕ РежимРаботыПоРабочимЦентрам;
	
	СохранитьНастройки(ЭтотОбъект);
	
	НастроитьЗависимыеЭлементыФормы(ЭтаФорма, "РежимРаботыПоУчасткам");
	
КонецПроцедуры

&НаКлиенте
Процедура Рин1_ВРЦПередНачаломДобавленияВместо(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Группа ИЛИ Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	
	Если РежимРаботыПоУчасткам Тогда
		
		ТекущаяСтрока = Элементы.Участки.ТекущаяСтрока;
		Если не ОтборПоВидуУчастку И ТекущаяСтрока <> Неопределено Тогда
			
			Если ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				ЗначенияЗаполнения.Вставить("Подразделение", ТекущаяСтрока.Ключ);
			Иначе
				ЗначенияЗаполнения.Вставить("Участок", ТекущаяСтрока);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначенияЗаполнения.Количество() > 0 Тогда
		
		Отказ = Истина;
		
		ОткрытьФорму("Справочник.РабочиеЦентры.ФормаОбъекта",
			Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Рин1_РабочиеЦентрыПередНачаломДобавленияВместо(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Группа ИЛИ Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	
	Если РежимРаботыПоУчасткам Тогда
		
		ТекущаяСтрока = Элементы.Участки.ТекущаяСтрока;
		
		Если не ОтборПоВидуУчастку И ТекущаяСтрока <> Неопределено Тогда   //bercut281119 
		//Если ОтборПоВидуУчастку И ТекущаяСтрока <> Неопределено Тогда
			
			Если ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				ЗначенияЗаполнения.Вставить("Подразделение", ТекущаяСтрока.Ключ);
			Иначе
				ЗначенияЗаполнения.Вставить("Участок", ТекущаяСтрока);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ТекущаяСтрока = Элементы.ВидыРабочихЦентров.ТекущаяСтрока;
		Если ОтборПоВидуУчастку	И ТекущаяСтрока <> Неопределено Тогда
			ЗначенияЗаполнения.Вставить("ВидРабочегоЦентра", ТекущаяСтрока);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначенияЗаполнения.Количество() = 0 И НЕ Подразделение.Пустая() Тогда
		ЗначенияЗаполнения.Вставить("Подразделение", Подразделение);
	КонецЕсли;
	
	Если ЗначенияЗаполнения.Количество() > 0 Тогда
		
		Отказ = Истина;
		
		ОткрытьФорму("Справочник.РабочиеЦентры.ФормаОбъекта",
			Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
		
	КонецЕсли;

КонецПроцедуры
